package main

// Урок 1. Задание 1: анализатор чисел.
//
// Напиши консольную программу, которая:
//  1. Запрашивает целое число N.
//  2. Проверяет ошибку чтения.
//  3. Принимает только N в диапазоне от 1 до 10 000 включительно.
//  4. С помощью цикла проходит по всем числам от 1 до N.
//  5. Выводит:
//     - сумму всех чисел;
//     - количество четных чисел;
//     - количество нечетных чисел;
//     - сумму чисел, которые делятся на 3.
//
// Ограничения:
//   - сумму чисел от 1 до N нужно вычислить циклом, а не формулой;
//   - при ошибочном вводе программа должна вывести понятное сообщение;
//   - используй целочисленные типы, условия и цикл for;
//   - отформатируй файл командой gofmt.
//
// Примеры для самостоятельной проверки:
//
//	N = 1  -> сумма 1, четных 0, нечетных 1, сумма кратных 3 равна 0
//	N = 6  -> сумма 21, четных 3, нечетных 3, сумма кратных 3 равна 9
//	N = 0  -> сообщение о недопустимом диапазоне
//	N = abc -> сообщение об ошибке чтения
//
// TODO: реализуй решение внутри main и при необходимости выдели свои функции.
import "fmt"

// Выполним все условия по суммах всех чисел
func accumulation(num int) (int, int, int, int) {
	sum, evenCount, oddCount, dividedBy3 := 0, 0, 0, 0
	for i := 1; i <= num; i++ {
		if i%2 == 0 {
			evenCount++
		} else {
			oddCount++
		}
		if i%3 == 0 {
			dividedBy3 += i
		}
		sum += i
	}
	return sum, evenCount, oddCount, dividedBy3
}

func main() {
	var number int
	fmt.Println("Введите целое число от 1 до 10000 включительно:")
	_, err := fmt.Scan(&number)
	if err != nil {
		fmt.Printf("Значение не сооветствует целому числу. Error: %s", err)
		return
	}
	if number < 1 || number > 10000 {
		fmt.Println("Значение должно входить в диапозон [1, 10000]")
		return
	}
	sum, evenCount, oddCount, dividedBy3 := accumulation(number)
	fmt.Printf("Общая сумма: %d\nКоличество четных: %d\nКоличество нечетных: %d\nСумма чисел, которые делятся на 3: %d\n", sum, evenCount, oddCount, dividedBy3)
}
